cylinderTut/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 12 -7.5 -0.0355) // 0
    ( 12  7.5 -0.0355) // 1
    (-3  7.5 -0.0355) // 2
    (-3 -7.5 -0.0355) // 3
    ( 12 -7.5  0.0355) // 4
    ( 12  7.5  0.0355) // 5
    (-3  7.5  0.0355) // 6
    (-3 -7.5  0.0355) // 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (210 210 1)
    simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
        (2 6 7 3) // (0 4 5 1)
    )
    patch outlet
    (
        (0 4 5 1) // (2 6 7 3)
    )
    wall walls
    (
        (1 5 6 2)
        (4 0 3 7)
    )
    empty front
    (
        (4 7 6 5)
    )
    empty back
    (
        (0 1 2 3)
    )
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
